
read_verilog serie_paralelo_IDLE.v

read_verilog -lib cmos_cells.v

hierarchy -check -top serieparalelo_IDLE

proc

opt

fsm

opt

memory

opt

techmap

opt

dfflibmap -liberty cmos_cells.lib

abc –liberty cmos_cells.lib

clean

stat -liberty cmos_cells.lib

write_verilog serie_paralelo_IDLE_syn.v

show \serieparalelo_IDLE
