
read_verilog paralelltoserial_IDLE.v

read_verilog -lib cmos_cells.v

hierarchy -check -top paralelo_a_serial_IDLE

proc

opt

fsm

opt

memory

opt

techmap

opt

dfflibmap -liberty cmos_cells.lib

abc –liberty cmos_cells.lib

clean

stat -liberty cmos_cells.lib

write_verilog paralelltoserial_IDLE_syn.v

show \paralelo_a_serial_IDLE
