
read_verilog serieparalelo.v

read_verilog -lib cmos_cells.v

hierarchy -check -top serieparalelo

proc

opt

fsm

opt

memory

opt

techmap

opt

dfflibmap -liberty cmos_cells.lib

abc –liberty cmos_cells.lib

clean

stat -liberty cmos_cells.lib

write_verilog serieparalelo_struct_syn.v

show \serieparalelo
