
read_verilog mux2x1_behav.v

read_verilog -lib cmos_cells.v

hierarchy -check -top mux2x1_behav

proc

opt

fsm

opt

memory

opt

techmap

opt

dfflibmap -liberty cmos_cells.lib

abc –liberty cmos_cells.lib

clean

stat -liberty cmos_cells.lib

write_verilog mux2x1_struct_syn.v

show
